# SQL

In [2]:
import psycopg2
from sqlalchemy import create_engine
%load_ext sql
import pandas as pd

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Below is the link I followed to connect to the Data base

https://pynative.com/python-postgresql-tutorial/

Establish the connection

In [3]:
connection = psycopg2.connect(user = "user",
                                  password = "pass",
                                  host = "localhost",
                                  port = "5432",
                                  database = "umuzi")
# as per the instructions the repo

- create a connection
- create a cursor
- execute using a cursor
- commit

We need an engine to allow Pandas to read the database

In [4]:
engine = create_engine('postgresql://user:pass@localhost/umuzi')

## Creating a database

### 1.Create a database called “Umuzi”.

In [5]:
# CREATE DATABASE Umuzi

### 2.Create the following tables in the Umuzi database:

- Customers
- Employees
- Orders
- Payments
- Products

### 3.Create a primary key for each table with auto-increment: 
- make sure you correctly specify the data types, e.g. the ID field should be int.
    - A primary key is considered to be a key with unique records.
    
### 4.Create foreign keys so that every ID in the order table references an existing ID in the tables referenced :
- ProductID, EmployeeID, etc.
- A foreign key is a column that provides a link between tables.

### The code executed on the SQL command

In [6]:
# CREATE TABLE Customers(
# CustomerID SERIAL  UNIQUE, 
# FirstName VARCHAR(50),
# LastName VARCHAR(50),
# Gender VARCHAR,
# Address VARCHAR(200),
# Phone INT,
# Email VARCHAR(100)  UNIQUE,
# City  VARCHAR(20),
# Country VARCHAR(50),
# PPRIMARY KEY(CustomerID) 
# )

In [7]:
# CREATE TABLE  Employees(
# EmployeeID  SERIAL  UNIQUE,
# FirstName  VARCHAR(50),
# LastName VARCHAR(50),
# Email VARCHAR(100)  UNIQUE,
# JobTitle VARCHAR(20),
# PRIMARY KEY(EmployeeID)
# )

In [8]:
# CREATE TABLE Orders(
# OrderId  SERIAL  UNIQUE,
# ProductID  INT  REFERENCE Products(ProductId),
# PaymentID  INT  REFERNCE Payments(PaymentID),
# FulfilledByEmployeeID INT  REFERNCE Employees(EmployeeID),
# DateRequired  DATE,
# DateShipped  DATE,
# Status  VARCHAR(20),
# PRIMARY KEY(OrderId)
# )

In [9]:
# CREATE TABLE Payments(
# CustomerId  INT  UNIQUE,
# PaymentID INT  UNIQUE,
# PaymentDate  DATE,
# Amount  DECIMAL,
# PRIMARY KEY(PaymentID)

# )

In [10]:
# CREATE TABLE Products(
# ProductName VARCHAR(100),
# Description  VARCHAR(300),
# BuyPrice  DECIMAL,
# PRIMARY KEY(ProductId)
# )

### 5.INSERT the records in the tables below into the table you created in step 2.

In [11]:
# INSERT INTO customers ( 
# FirstName,LastName,Gender,Address,Phone,Email,City,Country)
#  VALUES ('John','Hibert','Male','284 chaucer st',084789657,'john@gmail.com,Johannesburg','South Africa'),
# ('Thando','Sithole','Female','240 Sect 1',0794445584,'thando@gmail.com','Cape Town',	'South Africa'),
# ('Leon','Glen',	'Male',	'81 Everton Rd,Gillits',0820832830,'Leon@gmail.com','Durban','South Africa'),
# ('Charl','Muller','Male','290A Dorset Ecke',+44856872553,'Charl.muller@yahoo.com','Berlin','Germany'),
# ('Julia','Stein','Female','2 Wernerring',+448672445058,'Js234@yahoo.com','Frankfurt', 'Germany');

In [12]:
# INSERT INTO Employees(FirstName,LastName,Email,JobTitle)
#  VALUES ('Kani','Matthew','mat@gmail.com','Manager'),
# ('Lesly','Cronje','LesC@gmail.com','Clerk'),
# ('Gideon','Maduku','m@gmail.com','Accountant');

In [13]:
# INSERT INTO Products(ProductId,ProductName,Description,BuyPrice)
# VALUES
# (1,'Harley Davidson Chopper', 'This replica features working kickstand, front suspension, gear-shift lever',150.75),
# (2, 'Classic Car', 'Turnable front wheels, steering function',550.75),
# (3, 'Sports car', 'Turnable front wheels, steering function',700.60)
# ;

In [14]:
# INSERT INTO Payments(CustomerId,PaymentID,PaymentDate,Amount)
# VALUES
# (1,1,'01-09-2018',150.75),
# (5,2,'03-09-2018',150.75),
# (4,3,'03-09-2018',700.60),
# ;

In [15]:
# INhttp://localhost:8888/notebooks/SQL%20.ipynb#Document-what-information-is-stored-in-your-database.-Be-sure-to-say-what-information-is-kept-in-what-table,-and-which-keys-link-the-records-between-tablesSERT INTO Orders
# (ProductID,PaymentID,FulfilledByEmployeeID,DateRequired,DateShipped,Status)
# VALUES
# (1, 1, 2, '05-09-2018', NULL, 'Not shipped'),
# (1, 2, 2, '04-09-2018', '03-09-2018', 'Shipped'),
# (3, 3, 3, '06-09-2018', NULL, 'Not shipped');

#### Document what information is stored in your database. Be sure to say what information is kept in what table, and which keys link the records between tables

Customers table has the personal details of the customers such as names and where they live. The Employees table has personal details of employees including the job titles. Then the Oders table contains the details about the products,their shipment and which employee is responsible for the oder therefore it is linked to Employees table.We also have the payments table which has the details about which products are payed for and how much the customer paid for it. The table is linked to payments Customers table and Oders table. Lastly we have Products table which has records of products sold.It is linked with Oders table.

## Querying a database

### 1.SELECT ALL records from table Customers.

In [16]:
pd.read_sql('SELECT * from customers',engine)

,customerid,firstname,lastname,gender,address,phone,email,city,country
0,3,Leon,Glen,Male,"81 Everton Rd,Gillits",820832830,Leon@gmail.com,Durban,South Africa
1,4,Charl,Muller,Male,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany
2,5,Julia,Stein,Female,2 Wernerring,448672445058,Js234@yahoo.com,Frankfurt,Germany
3,1,Lerato,Mabitso,Male,284 chaucer st,84789657,john@gmail.com,Johannesburg,South Africa

### 2.SELECT records only from the name column in the Customers table

In [17]:
pd.read_sql('SELECT firstname from customers',engine)

  firstname
0      Leon
1     Charl
2     Julia
3    Lerato

### 3.Show the name of the Customer whose CustomerID is 1

In [18]:
pd.read_sql('SELECT firstname from customers WHERE CustomerID =1',engine)

  firstname
0    Lerato

### 4.UPDATE the record for CustomerID = 1 on the Customer table so that the name is “Lerato Mabitso”.

Using the connection established to run executions in the database by creating a cursor.

In [20]:
cursor = connection.cursor()
cursor.execute("UPDATE customers SET firstname = 'Lerato', lastname= 'Mabitso' WHERE customerID = 1")
connection.commit()
pd.read_sql('SELECT * from customers WHERE CustomerID =1',engine)

,customerid,firstname,lastname,gender,address,phone,email,city,country
0,1,Lerato,Mabitso,Male,284 chaucer st,84789657,john@gmail.com,Johannesburg,South Africa

In [21]:
# pd.read_sql("UPDATE customers SET firstname = 'Lerato', lastname= 'Mabitso' WHERE customerID = 1",engine)

### 5.DELETE the record from the Customers table for customer 2 (CustomerID = 2)

In [23]:
cursor = connection.cursor()
cursor.execute('DELETE FROM Customers WHERE CustomerID = 2')
# a = cursor.fetchall()
connection.commit()
pd.read_sql('SELECT * from customers WHERE CustomerID =2',engine)

Empty DataFrame
Columns: [customerid, firstname, lastname, gender, address, phone, email, city, country]
Index: []

There is no entry for this ID because it is deleted.

In [25]:
# pd.read_sql('DELETE FROM Customers WHERE CustomerID = 2',engine)

### 6.Select all unique statuses from the Orders table and get a count of the number of orders for each unique status

In [26]:
pd.read_sql('SELECT COUNT(DISTINCT status) FROM orders',engine)

   count
0      2

### 7.Return the MAXIMUM payment made on the PAYMENTS table.

In [27]:
pd.read_sql('SELECT MAX(Amount) from payments',engine)

     max
0  700.6

### 8.Select all customers from the “Customers” table, sorted by the “Country” column.

In [28]:
pd.read_sql('SELECT * FROM Customers ORDER BY Country',engine)

,customerid,firstname,lastname,gender,address,phone,email,city,country
0,4,Charl,Muller,Male,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany
1,5,Julia,Stein,Female,2 Wernerring,448672445058,Js234@yahoo.com,Frankfurt,Germany
2,3,Leon,Glen,Male,"81 Everton Rd,Gillits",820832830,Leon@gmail.com,Durban,South Africa
3,1,Lerato,Mabitso,Male,284 chaucer st,84789657,john@gmail.com,Johannesburg,South Africa

### 9.Select all products with a price BETWEEN R100 and R600.

In [29]:
pd.read_sql('SELECT * FROM Products WHERE buyprice BETWEEN 100 AND 600',engine)

,productid,productname,description,buyprice
0,1,Harley Davidson Chopper,"This replica features working kickstand, front...",150.75
1,2,Classic Car,"Turnable front wheels, steering function",550.75

### 10.Select all fields from “Customers” where country is “Germany” AND city is “Berlin”.

In [30]:
pd.read_sql("SELECT * FROM customers WHERE country = 'Germany' AND city = 'Berlin'",engine)

,customerid,firstname,lastname,gender,address,phone,email,city,country
0,4,Charl,Muller,Male,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany

### 11.Select all fields from “Customers” where city is “Cape Town” OR “Durban”

In [31]:
pd.read_sql("SELECT * FROM customers WHERE city = 'Cape Town' OR city = 'Durban'",engine)

,customerid,firstname,lastname,gender,address,phone,email,city,country
0,3,Leon,Glen,Male,"81 Everton Rd,Gillits",820832830,Leon@gmail.com,Durban,South Africa

### 12.Select all records from Products where the Price is GREATER than R500.

In [32]:
pd.read_sql('SELECT * From Products WHERE buyprice > 500 ',engine)

   productid  productname                               description  buyprice
0          2  Classic Car  Turnable front wheels, steering function    550.75
1          3   Sports car  Turnable front wheels, steering function    700.60

### 13.Return the sum of the Amounts on the Payments table.

In [33]:
pd.read_sql('SELECT SUM(Amount) FROM payments',engine)

      sum
0  1002.1

### 14.Count the number of shipped orders in the Orders table.

In [34]:
pd.read_sql("SELECT COUNT( status) FROM orders where status = 'Shipped'",engine)

   count
0      1

### 15.Return the average price of all Products, in Rands and in Dollars (assume the exchange rate is R12 to the Dollar).

In [35]:
pd.read_sql("SELECT AVG(buyprice) AS rands, AVG(buyprice) /12 AS dollars FROM products",engine)

        rands    dollars
0  467.366667  38.947222

### 16.Using INNER JOIN create a query that selects all Payments with Customer information.

In [36]:
pd.read_sql("SElECT *  FROM Payments INNER JOIN customers ON Payments.CustomerID = Customers.CustomerID",engine)

,customerid,paymentid,paymentdate,amount,customerid,firstname,lastname,gender,address,phone,email,city,country
0,1,1,2018-01-09,150.75,1,Lerato,Mabitso,Male,284 chaucer st,84789657,john@gmail.com,Johannesburg,South Africa
1,5,2,2018-03-09,150.75,5,Julia,Stein,Female,2 Wernerring,448672445058,Js234@yahoo.com,Frankfurt,Germany
2,4,3,2018-03-09,700.60,4,Charl,Muller,Male,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany

### 17.Select all products that have turnable front wheels.

In [37]:
cursor = connection.cursor()
cursor.execute("SElECT *  FROM Products WHERE Description LIKE  '%Turnable front wheels%'")
a = cursor.fetchall()
connection.commit()
a

[(2,
  'Classic Car',
  'Turnable front wheels, steering function',
  Decimal('550.75')),
 (3,
  'Sports car',
  'Turnable front wheels, steering function',
  Decimal('700.60'))]

In [38]:
# pd.read_sql("SElECT *  FROM Products WHERE Description LIKE  '%Turnable front wheels%'",engine)

### Closing the connection

In [39]:
cursor.close()
connection.close()